Repository: Alexandru-D6/Electrike_pes
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# languageName
source: English
ca: Català
es: Español

source: Map
ca: Mapa
es: Mapa

source: Garage
ca: Garatge

source: Favourites
ca: Favorits
es: Favoritos

source: Achievements
ca: Trofeus
es: Logros

source: Information
ca: Informació
es: Información

source: Contact us
ca: Contacta'ns
es: Contáctanos

source: Logout
ca: Tancar sessió
es: Cerrar sesión

source: Language
ca: Idioma
es: Idioma

source: System language
ca: Idioma del sistema
es: Lenguaje del sistema

source: All favourites
ca: Els meus favorits
es: Todos mis favoritos

source: Chargers
ca: Carregadors
es: Cargadores

# newCar
source: New vehicle
ca: Vehicle nou
es: Nuevo vehículo

source: Efficiency
ca: Consum
es: Consumo

# carBrand
source: Brand
ca: Marca
es: Marca

# carNameHint
source: The Amazing Red Car
ca: El incrible cotxe vermell
es: El increíble buga rojo

# carNameLabel
source: Name of the vehicle
ca: Nom del cotxe
es: Nombre del vehiculo

# carBatteryLabel
source: Battery(kWh)
ca: Bateria(kWh)
es: Batería(kWh)

# carEfficiency
source: Efficiency(Wh/Km)
ca: Consum(Wh/Km)
es: Consumo(Wh/Km)

# carBrandLabel
source: Please select a brand
ca: Si us plau, seleciona una marca
es: Por favor, slecciona una marca

# maxCharMssg
source: You cannot have more than 15 characters
ca: El màxim número de caràcters és 15
es: El máximo número de caácteres es 15

# chargerTypeLabel
source: Select the charger that the car can use (also take into consideration the adapters, in case of having any)
ca: Selecciona els carregadors que pot utilitzar (tingues en compte també els adaptadors, en el cas de tenir-ne cap)
es: Selecciona los cargadores que puede utilizar (ten en cuenta los adaptadores en el caso de tener alguno)

source: Add
ca: Afegir
es: Añadir

source: Log-in
ca: Iniciar sessió
es: Iniciar sesión

# notLogged
source: You aren't logged yet
ca: Encara no has iniciat sessió
es: Aún no has inicado sessión

source: Click to log-in
ca: Pulsa per iniciar sessió
es: Haga clic para iniciar sesión

# alertSureDeleteCarTitle
source: Are you sure you want to delete this vehicle?
ca: Estas segur de voler eliminar aquest vehicle?
es: ¿Estás seguro de que quieres eliminar este coche?

# alertSureDeleteCarContent
source: Deleting this car is permanent and will remove all data saved associated to this vehicle. Are you sure you want to continue?
ca: Borrar un vehicle és una acció permanent que elimina totes les dades associades. Estas segur de voler continuar?
es: La eliminación de este vehículo es permanente y eliminará todos los datos guardados asociados a éste. ¿Estás seguro de que quieres continuar?

# msgSelectChargers
source: At least select one type of charger
ca: Selecciona al menys un carregador
es: Selecciona al menos un cargador

# msgIntroNum
source: Introduce a number
ca: Introdueix un número
es: Introduce un número

# msgAddFav
source: Add or remove a favorite point
ca: Afegir o eliminar punt favorit
es: Añadir o eliminar punto favorito

# lunes
source: Monday
ca: Dilluns
es: Lunes

# martes
source: Tuesday
ca: Dimarts
es: Martes

# miercoles
source: Wednesday
ca: Dimecres
es: Miercoles

# jueves
source: Thursday
ca: Dijous
es: Jueves

# viernes
source: Friday
ca: Divendres
es: Viernes

# sabado
source: Saturday
ca: Dissabte
es: Sabado

# domingo
source: Sunday
ca: Diumenge
es: Domingo

# infoCar
source: The vehicle's name is {selectedNameCar}\n It's Brand {selectedBrandCar}\n It's model {selectedModelCar}\n Battery {selectedBatteryCar} kWh\n Effciency {selectedEffciencyCar} Wh/Km\n The vehicle uses {selectedPlugs}\n'''),
ca: El nom del vehicle és {selectedNameCar}\n La seva marca {selectedBrandCar}\n El seu model {selectedModelCar}\n Bateria {selectedBatteryCar} kWh\n Consum {selectedEffciencyCar} Wh/Km\n El vehicle utilitza {selectedPlugs}\n'''),
es: El nombre del vehículo es {selectedNameCar}\n Su marca {selectedBrandCar}\n Su modelo {selectedModelCar}\n Batería {selectedBatteryCar} kWh\n Consumo {selectedEffciencyCar} Wh/Km\n El vehículo utiliza {selectedPlugs}\n'''),

# textWithPlaceholder
source: Welcome {name}
ca: Benvingut {name}

# textWithPlaceholders
source: My name is {lastName}, {firstName} {lastName}
ca: El meu nom és {lastName}, {firstName} {lastName}

# infoDialogNotLog
source: You aren't logged
ca: No s'ha iniciat sessió
es: No se ha iniciado sesión

source: Cancel
ca: Cancel·lar
es: Cancelar

source: Delete
ca: Eliminar
es: Eliminar

source: Profile
ca: Perfil
es: Perfil

# save
source: Save changes
ca: Guardar canvis
es: Guardar cambios

source: Trophies
ca: Trofeus
es: Trofeos

source: Saved CO2
ca: CO2 estalviat
es: CO2 ahorrado

source: Kilometerstraveled
ca: Quilòmetres recorreguts
es: Kilómetros recorridos

source: Routes taken
ca: Rutes realitzades
es: Rutas realizadas

# deleteaccountquestion
source: Are you sure you want to delete your account?
ca: Estàs segur que vols eliminar el teu compte?
es: ¿Estás seguro de que quieres eliminar tu cuenta?

# deleteaccountdesc
source: Deleting the account is permanent and will remove all content including cars, favourites points and profile settings.
ca: L'eliminació del compte és permanent i eliminarà tot el contingut, inclosos els vehicles, els punts preferits i la configuració del perfil.
es: La eliminación de la cuenta es permanente y eliminará todo el contenido, incluidos los vehículos, los puntos favoritos y la configuración del perfil.

# day1
source: Monday
ca: Dilluns
es: Lunes

# day2
source: Tuesday
ca: Dimarts
es: Martes

# day3
source: Wednesday
ca: Dimecres
es: Miércoles

# day4
source: Thursday
ca: Dijous
es: Jueves

# day5
source: Friday
ca: Divendres
es: Viernes

# day6
source: Saturday
ca: Dissabte
es: Sábado

# day7
source: Sunday
ca: Diumenge
es: Domingo

source: Notification settings
ca: Configuració de notificacions
es: Configuración de notificaciones

# receiveNoti
source: Frequency
ca: Repetició
es: Repetición

# time
source: Hour
ca: Hora
es: Hora

# addNoti
source: Add notification
ca: Afegir notificació
es: Añadir notificación

# notificationInfoMsg
source: A notificacion will be sent in {days} at {hora}:{min}
ca: Rebràs una notificació els {days} a les {hora}:{min}
es: Recibirás una notificación los {days} a las {hora}:{min}

# addFavPoints
source: Add or remove a favorite point
ca: Afegir o eliminar punt favorit
es: Añadir o eliminar punto favorito

# explNoFav
source: Log-in to see your favourites
ca: Inicia sessió per consultar els teus favorits
es: Inicia sessión para consultar tus favoritos

# hideMarkers
source: Hide all
ca: Amagar tots
es: Esconder todos

# showMarkers
source: Show all
ca: Mostrar tots
es: Mostrar todos

# favouritesMark
source: Favourites
ca: Favourits
es: Favoritos

# selectCar
source: Select a vehicle
ca: Escull un vehicle
es: Escoge un vehículo

# actualBatMsg
source: Enter the remaining battery
ca: Introdueix la bateria restant
es: Introduce la bateria restante

# selectRouteType
source: Select a route type
ca: Escull un tipus de ruta
es: Escoge un tipo de ruta

source: Standard
ca: Estàndard
es: Estándar

source: Charging stop
ca: Parada per càrrega
es: Parada para cargar

source: Start
ca: Inicia
es: Iniciar

source: Occupation Chart
ca: Gràfics d'ocupació
es: Gráficas de ocupación

source: Occupation Chart Legend
ca: Llegenda de Gràfics d'Ocupació
es: Leyenda de Gráficas de Ocupación

source: Occupancy
ca: Ocupació
es: Ocupación

source: Hours
ca: Hores
es: Horas

# yourLocation
source: My location
ca: La meva localització
es: Mi localización

# thispage
source: In this page
ca: En aquesta pàgina
es: En esta página

# thispagedesc
source: You can see the stats about the concurrency of a charge station from Barcelona during the day.
ca: Pots veure les estadístiques sobre la concurrència d'una estació de carrèga de Barcelona durant el dia.
es: Puedes ver las estadísticas sobre la concurrencia de una estación de carga de Barcelona durante el día.

# clickdropdownbutton
source: Click on dropdown button
ca: Clic al botó desplegable
es: Clic en el botón desplegable

# clickdropdownbuttondesc
source: You can change the day and it's associated values to the plot by clicking on the dropdown button.
ca: Pots canviar el dia i els seus valors associats a la gràfica fent clic al botó desplegable.
es: Puede cambiar el día y sus valores asociados al gráfico haciendo clic en el botón desplegable.

source: Concurrency percentage
ca: Percentatge de concurrència
es: Porcentaje de concurrencia

# concurrencypercentagedesc
source: On the Y axis of the plot, you can see the concurrency percentage for a specific hour of the day.
ca: A l'eix Y de la trama, pots veure el percentatge de concurrència per a una hora específica del dia.
es: En el eje Y del gráfico, puedes ver el porcentaje de simultaneidad para una hora específica del día.

source: Concurrency hours
ca: Hores de concurrència
es: Horas de concurrencias

# concurrencyhoursdesc
source: On the X axis of the plot, you can see the hours of a day, where the bars indicating the concurrency are.
ca: A l'eix X de la trama, pots veure les hores d'un dia, on hi ha les barres que indiquen la concurrència.
es: En el eje X del gráfico, puedes ver las horas de un día, donde están las barras que indican la concurrencia.

# errordesc
source: If the plot is empty, it could mean 2 things, nobody utilizes the charger or there's an error where you will need to update the page.
ca: Si la gràfica està buida, pot significar 2 coses, ningú fa servir el carregador o hi ha un error en què haureu d'actualitzar la pàgina.
es: Si la gráfica está vacía, puede significar 2 cosas, nadie utiliza el cargador o hay un error en el que deberá actualizar la página.

# notLoggedMsg
source: Log-in is required
ca: Se requiere inicio de sesión
es: Se requiere inicio de sessión

# keyChargers
source: Charging point key
ca: Llegenda de punts de càrrega
es: Leyenda de puntos de carga

# keyBicing
source: Bicing station key
ca: Llegenda d'estacions Bicing
es: Leyenda de estaciones Bicing

# keyFavourites
source: Favourites key
ca: Llegenda de Favorits
es: Llegenda de favorits

source: Station name
ca: Nom de la estació
es: Nombre de la estación

source: Street name
ca: Nom del carrer
es: Nombre de la calle

# availableChargers
source: Available
ca: Disponibles
es: Disponibles

# numChargers
source: Number of available chargers
ca: Nombre de carregadors disponibles
es: Número de cargadores disponibles

source: Unknown state
ca: Estat desconegut
es: Estado desconocido

# numUnknown
source: Number of chargers of unknown state
ca: Nombre de carregadors d'estat desconegut
es: Número de cargadores de estado desconocido

source: Broken
ca: Espatllat
es: Roto

# numBroken
source: Number of broken chargers
ca: Nombre de carregadors espatllats
es: Número de cargadores rotos

source: Not available
ca: No disponible
es: No disponible

# numNotAvailable
source: Number of not available chargers
ca: Nombre de carregadors no disponibles
es: Número de cargadores no disponibles

source: Free places
ca: Llocs lliures
es: Sitios libres

# numFreePlaces
source: Number of free places
ca: Nombre de llocs lliures
es: Número de sitios libres

# availablePedal
source: Available pedal bikes
ca: Disponibilitat de bicicletes de pedals
es: Disponibilidad de bicicletas de pedales

# numPedal
source: Number of pedal bikes
ca: Nombre de bicicletes de pedals
es: Número de bicicletas de pedales

# availableElectric
source: Available electric bicycles
ca: Disponibilitat de bicicletes elèctriques
es: Disponibilidad de bicicletas eléctricas

# numElectric
source: Number of available electric bicycles
ca: Nombre de bicicletes elèctriques disponibles
es: Número de bicicletas eléctricas disponibles

# clickName
source: Click on the name
ca: Clica el nom
es: Pulsa el nombre

# clickNameDescr
source: You can go to the location on the map by selecting the point
ca: Pots anar a la localització en el mapa pulsant el punt
es: Puedes ir a la localización en el mapa pulsando el punto

# seeConcurrencyChart
source: See station occupancy percentage
ca: Consulta els percentatges de ocupació
es: Consultar los porcentages de ocupación

# chartsDescr
source: Shows the occupation of the station during the day
ca: Mostra l'ocupació de l'estació de càrrega
es: Muestra la ocupación de la estación de carga

# disableNoti
source: Disable notifications
ca: Desactivar notificacions
es: Desactivar notificaciones

# disableNotiDescr
source: Disable all notifications (if have any)
ca: Desactivar totes les notificacions (si n'hi ha)
es: Desactivar todas las notificaciones (si las hay)

# enableNoti
source: Enable notifications
ca: Activar notificacions
es: Activar notificaciones

# enableNotiDescr
source: Enable all notifications (if have any) so you can receive the occupancy rate of a charger
ca: Activar totes les notificacions (si n'hi ha) per tal de rebre gàfics de concurrència del punt de càrrega
es: Activar todas las notificaciones (si las hay) para recibir el estado de ocupación de un cargador

# notificationSettingsDescr
source: Shows all the notifications created for the point. Here you can add more or delete others.
ca: Mostra les teves notificacions del carregador. Pots afegir de noves o eliminar-ne existents.
es: Muestra todas tus notificaciones para el punto. Aqui puedes añadir nuevas o eliminar existentes.

# rmvFavs
source: Remove from favourites
ca: Eliminar de favorits
es: Eliminar de favoritos

# rmvFavsDescr
source: You can remove directly the point from your favourites list.
ca: Pots eliminar un punt de la texa llista de favorits
es: Puedes eliminar un punto de tu lista de favoritos.

# filterFavTypes
source: Filter between types
ca: Filtra entre tipus
es: Filtra entre tipos

# filterFavTypesDescr
source: Filter the types of favourite points using the bottom buttons
ca: Filtra els teus punts favorits utilitzant el menú superior
es: Filtra tus puntos favoritos usando el menú superior

source: Add alert
ca: Afegeix notificació
es: Añadir notificación

# addAlertDescr
source: You need to have at least one created alert associated with the point.
ca: Necessites crear al menys una notificació associada a aquest punt de càrrega.
es: Necesitas crear el menos una notificación asociada a este punto de carga.

# addalertdesc
source: You haven't got any alert associated with this point. Add at least one to receive notifications from this point.
ca: No tens cap notificació associada a aquest punt. Afegiu almenys una per rebre notificacions des d'aquest punt.
es: No tienes ninguna notificación asociada a este punto. Agrega al menos uno para recibir notificaciones desde este punto.

source: SKIP
ca: SALTAR
es: SALTAR

source: NEXT
ca: SEGÜENT
es: SIGUIENTE

source: Duration
ca: Temps
es: Tiempo

source: Distance
ca: Distància
es: Distancia

source: unlocked
ca: desbloquejat
es: desbloqueado

source: locked
ca: bloquejat
es: bloqueado

source: State:
ca: Estat:
es: Estado:

# nametrophy
source: Trophy:
ca: Trofeu:
es: Trofeo:

# trophy0
source: Your first vehicle!
ca: El teu primer vehicle!
es: ¡Tu primer vehículo!

# trophy1
source: Three is a multitude of vehicles
ca: Tres són una multitud de vehicles
es: Tres son una multitud de vehículos

# trophy2
source: Your garage is amazing!
ca: El teu garatge és increïble!
es: ¡Tu garaje es impresionante!

# trophy3
source: Destiny found
ca: Destinació trobada
es: Destino encontrado

# trophy4
source: Excursionist
ca: Excursionista
es: Excursionista

# trophy5
source: Globetrotter
ca: Rodamón
es: Trotamundos

# trophy6
source: Less CO2
ca: Menys CO2
es: Menos CO2

# trophy7
source: It's time to save
ca: És hora d'estalviar
es: Es hora de ahorrar

# trophy8
source: Saving the planet
ca: Salvant el planeta
es: Salvando el planeta

# trophy9
source: The first kilometers
ca: Els primers quilòmetes
es: Los primeros kilómetros

# trophy10
source: Reaching 100
ca: Arribant als 100
es: Llegando a los 100

# trophy11
source: The road is your life
ca: La carretera és la teva vida
es: La carretera es tu vida

# trophy0desc
source: Add 1 vehicle to the garage
ca: Afegeix 1 vehicle al garatge
es: Añade 1 vehículo al garaje

# trophy1desc
source: Add 3 vehicles to the garage
ca: Afegeix 3 vehicles al garatge
es: Añade 3 vehículos al garaje

# trophy2desc
source: Add 5 vehicles to the garage
ca: Afegeix 5 vehicles al garatge
es: Añade 5 vehículos al garaje

# trophy3desc
source: Do 1 route
ca: Fes 1 ruta
es: Haz 1 ruta

# trophy4desc
source: Do 10 routes
ca: Fes 10 rutes
es: Haz 10 rutas

# trophy5desc
source: Do 50 routes
ca: Fes 50 ruta
es: Haz 50 rutas

# trophy6desc
source: Save 5 kg of CO2, using an electric vehicle
ca: Estalvia 5 kg de CO2, usant un vehicle elèctric
es: Ahorra 5 kg de CO2, usando un vehículo eléctrico

# trophy7desc
source: Save 20 kg of CO2, using an electric vehicle
ca: Estalvia 20 kg de CO2, usant un vehicle elèctric
es: Ahorra 20 kg de CO2, usando un vehículo eléctrico

# trophy8desc
source: Save 50 kg of CO2, using an electric vehicle
ca: Estalvia 50 kg de CO2, usant un vehicle elèctric
es: Ahorra 50 kg de CO2, usando un vehículo eléctrico

# trophy9desc
source: Travel 20 km with electric vehicles
ca: Recorre 20 km amb vehicles elèctrics
es: Recorre 20 km con vehículos eléctricos

# trophy10desc
source: Travel 100 km with electric vehicles
ca: Recorre 100 km amb vehicles elèctrics
es: Recorre 100 km con vehículos eléctricos

# trophy11desc
source: Travel 200 km with electric vehicles
ca: Recorre 200 km amb vehicles elèctrics
es: Recorre 200 km con vehículos eléctricos

source: NAVIGATION
ca: NAVEGA PER LA APLICACIÓ
es: NAVEGA POR LA APLICACIÓN

# navigationDescription
source: To navigate the application you can do it through the side menu by clicking on the symbol located in the upper left corner of your device or also by sliding from the left side to the right of the screen (without navigation gestures enabled). But be very careful, to access certain screens you must have previously logged in to be able to load your data.
ca: Per navegar per l'aplicació podeu fer-ho mitjançant el menú lateral clicant sobre el símbol situat a la cantonada superior esquerra del vostre dispositiu o també lliscant des del lateral esquerre cap a la dreta de la pantalla (sense els gestos de navegació habilitats). Però molt de compte, per accedir a determinades pantalles has d'haver iniciat sessió prèviament per poder carregar les teves dades.
es: Para navegar por la aplicación puedes hacerlo mediante el menú lateral clicando sobre el símbolo situado en la esquina superior izquierda de tu dispositivo o también deslizando desde el lateral izquierdo hacia la derecha de la pantalla (sin los gestos de navegación habilitados). Pero mucho cuidado, para acceder a determinadas pantallas debes haber iniciado sesión previamente para poder cargar tus datos.

# loginDescription
source: Log in with your user to be able to access all your account data and continue adding points towards sustainable mobility.
ca: Logueja't amb el teu usuari per poder accedir a totes les dades del teu compte i continuar sumant punts cap a una mobilitat sostenible.
es: Logueate con tu usuario para poder acceder a todos los datos de tu cuenta y seguir sumando puntos hacia una movilidad sostenible.

# getLocationTitle
source: FIND YOURSELF ON THE MAP
ca: TROBA'T AL MAPA
es: OBTENGA SU UBICACIÓN

# getLocationDescritpion
source: Tap in the top right corner next to the search bars to zoom in on your current location so you can see what's around you.
ca: Fes clic a la cantonada superior dreta al costat de les barres de cerca per fer zoom de la teva ubicació actual i poder veure què t'envolta.
es: Pulsa en la esquina superior derecha al lado de las barras de búsqueda para hacer zoom de tu ubicación actual y poder ver qué te rodea.

# appInfo
source: APP INFORMATION
ca: INFORMACIÓ SOBRE LA APLICACIÓ
es: INFORMACIÓN DE LA APLICACIÓN

# appInfoDescription
source: Normally on each screen there are visible symbols with an 'i' of information on the screen. Also, when you start the application for the first time, the tutorial will open. You should not worry about the following times, if you have seen the tutorial once, it will not return to you to leave until you log-out.
ca: Normalment a cada pantalla hi ha símbols visibles amb una 'i' d'informació sobre la pantalla. A més en iniciar l'aplicació per primera vegada s'obrirà el tutorial. No t'has de preocupar per les següents vegades, si has vist una vegada el tutorial no et tornarà a sortir fins que facis log-out.
es: Normalmente en cada pantalla hay símbolos visibles con una 'i' de información sobre la pantalla. Además al iniciar la aplicación por primera vez se abrirá el tutorial. No debes preocuparte por las siguientes veces, si has visto una vez el tutorial no te volverá a salir hasta que hagas log-out.

# favDescription
source: Quickly locate your favorite points, add alerts to receive the status of the points you want when you need it, check the occupancy statistics instantly or delete those points that are no longer relevant in your day-to-day...
ca: Localitza ràpidament els teus punts favorits, afegeix alertes per rebre l'estat dels punts que vulguis quan ho necessitis, consulta les estadístiques d'ocupació a l'instant o elimina aquells punts que ja no són rellevants al teu dia a dia...
es: Localiza rápidamente tus puntos favoritos, añade alertas para recibir el estado de los puntos que desees cuando lo necesites, consulta las estadísticas de ocupación al instante o elimina aquellos puntos que ya no son relevantes en tu día a día...

# addNotificationTitle
source: Add reminders
ca: Afegeix recordatoris
es: Añade recordatorios

# addNotificationDescription
source: Add reminders so that the application notifies you of the status of the selected point whenever you want.
ca: Afegeix recordatoris perquè l'aplicació t'avisi de l'estat del punt seleccionat quan vulguis.
es: Añade recordatorios para que la aplicación te avise del estado del punto seleccionado cuando desees.

# savePointsDescription
source: Save your favorite points to consult their information more easily.
ca: Salva els teus punts preferits per consultar la informació d'aquests de manera més fàcil.
es: Salva tus puntos favoritos para consultar la información de éstos de manera más fácil.

# filtraDescription
source: Filter the points according to your needs or hide them if you wish: hide, see them all, only charging points, only bicings or see your favorites.
ca: Filtra els punts segons les teves necessitats o amaga'ls si ho desitges: amagar, veure'ls tots, només punts de càrrega, només bicings o veure els teus favorits.
es: Filtra los puntos según tus necesidades o escóndelos si lo deseas: esconder, verlos todos, sólo puntos de carga, sólo bicings o ver tus favoritos.

# filtraTitle
source: FILTER THE POINTS YOU WANT TO SEE
ca: FILTRA ELS PUNTS QUE VOLS VEURE
es: FILTRA LOS PUNTOS QUE QUIERES VER

# addcargarage
source: Add a vehicle to the garage
ca: Afegeix un vehicle al garatge
es: Añade un vehículo al garaje

source: Legend
ca: Llegenda
es: Leyenda

source: Occupancy chart
ca: Gràfica d'ocupació
es: Gráfica de ocupación

source: Share
ca: Compartir
es: Compartir

# notiEnableDis
source: Enable or disable notifications of a charger
ca: Activar o desactivar notificacions d'un carregador
es: Activar o desactivar notificaciones de un cargador

# confnoti
source: Configure charger notifications
ca: Configurar notificacions del carregador
es: Configurar notificaciones del cargador

source: Default title
ca: Títol per defecte

# carModelLabel
source: Model
es: Modelo

source: Vehicles
es: Vehículos
